RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_i2c.h
/**
 **************************************************************************
 * File Name    : at32f4xx_i2c.h
 * Description  : at32f4xx I2C header file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_I2C_H
#define __AT32F4xx_I2C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup I2C
  * @{
  */

/** @defgroup I2C_Exported_Types
  * @{
  */

/**
  * @brief  I2C Init structure definition
  */

typedef struct
{
    uint32_t I2C_BitRate;           /*!< Specifies the clock frequency.
                                         This parameter must be set to a value lower than 400kHz */

    uint16_t I2C_Mode;              /*!< Specifies the I2C mode.
                                         This parameter can be a value of @ref I2C_mode */

    uint16_t I2C_FmDutyCycle;       /*!< Specifies the I2C fast mode duty cycle.
                                         This parameter can be a value of @ref I2C_duty_cycle_in_fast_mode */

    uint16_t I2C_OwnAddr1;          /*!< Specifies the first device own address.
                                         This parameter can be a 7-bit or 10-bit address. */

    uint16_t I2C_Ack;               /*!< Enables or disables the acknowledgement.
                                         This parameter can be a value of @ref I2C_acknowledgement */

    uint16_t I2C_AddrMode;          /*!< Specifies if 7-bit or 10-bit address is acknowledged.
                                         This parameter can be a value of @ref I2C_acknowledged_address */
} I2C_InitType;

/**
  * @}
  */


/** @defgroup I2C_Exported_Constants
  * @{
  */

#if defined (AT32F413xx) || defined (AT32F415xx)
#define IS_I2C_ALL_PERIPH(PERIPH)       (((PERIPH) == I2C1) || \
                                         ((PERIPH) == I2C2))
#elif defined (AT32F403xx) || defined (AT32F403Axx) || \
      defined (AT32F407xx)
#define IS_I2C_ALL_PERIPH(PERIPH)       (((PERIPH) == I2C1) || \
                                         ((PERIPH) == I2C2) || \
                                         ((PERIPH) == I2C3))
#endif

/** @defgroup I2C_mode
  * @{
  */

#define I2C_Mode_I2CDevice              ((uint16_t)0x0000)
#define I2C_Mode_SMBusDevice            ((uint16_t)0x0002)
#define I2C_Mode_SMBusHost              ((uint16_t)0x000A)
#define IS_I2C_MODE(MODE)               (((MODE) == I2C_Mode_I2CDevice) || \
                                         ((MODE) == I2C_Mode_SMBusDevice) || \
                                         ((MODE) == I2C_Mode_SMBusHost))
/**
  * @}
  */

/** @defgroup I2C_duty_cycle_in_fast_mode
  * @{
  */

#define I2C_FmDutyCycle_16_9            ((uint16_t)0x4000) /*!< I2C fast mode Tlow/Thigh = 16/9 */
#define I2C_FmDutyCycle_2_1             ((uint16_t)0xBFFF) /*!< I2C fast mode Tlow/Thigh = 2 */
#define IS_I2C_FM_DUTY_CYCLE(CYCLE)     (((CYCLE) == I2C_FmDutyCycle_16_9) || \
                                         ((CYCLE) == I2C_FmDutyCycle_2_1))
/**
  * @}
  */

/** @defgroup I2C_acknowledgement
  * @{
  */

#define I2C_Ack_Enable                  ((uint16_t)0x0400)
#define I2C_Ack_Disable                 ((uint16_t)0x0000)
#define IS_I2C_ACK_STATE(STATE)         (((STATE) == I2C_Ack_Enable) || \
                                         ((STATE) == I2C_Ack_Disable))
/**
  * @}
  */

/** @defgroup I2C_transfer_direction
  * @{
  */

#define  I2C_Direction_Transmit         ((uint8_t)0x00)
#define  I2C_Direction_Receive          ((uint8_t)0x01)
#define IS_I2C_DIRECTION(DIRECTION)     (((DIRECTION) == I2C_Direction_Transmit) || \
                                         ((DIRECTION) == I2C_Direction_Receive))
/**
  * @}
  */

/** @defgroup I2C_acknowledged_address
  * @{
  */

#define I2C_AddrMode_7bit               ((uint16_t)0x4000)
#define I2C_AddrMode_10bit              ((uint16_t)0xC000)
#define IS_I2C_ADDR_MODE(MODE)          (((MODE) == I2C_AddrMode_7bit) || \
                                         ((MODE) == I2C_AddrMode_10bit))
/**
  * @}
  */

/** @defgroup I2C_registers
  * @{
  */

#define I2C_Register_CTRL1              ((uint8_t)0x00)
#define I2C_Register_CTRL2              ((uint8_t)0x04)
#define I2C_Register_OADDR1             ((uint8_t)0x08)
#define I2C_Register_OADDR2             ((uint8_t)0x0C)
#define I2C_Register_DT                 ((uint8_t)0x10)
#define I2C_Register_STS1               ((uint8_t)0x14)
#define I2C_Register_STS2               ((uint8_t)0x18)
#define I2C_Register_CLKCTRL            ((uint8_t)0x1C)
#define I2C_Register_TMRISE             ((uint8_t)0x20)
#define IS_I2C_REGISTER(REGISTER)       (((REGISTER) == I2C_Register_CTRL1)  || \
                                         ((REGISTER) == I2C_Register_CTRL2)  || \
                                         ((REGISTER) == I2C_Register_OADDR1) || \
                                         ((REGISTER) == I2C_Register_OADDR2) || \
                                         ((REGISTER) == I2C_Register_DT)     || \
                                         ((REGISTER) == I2C_Register_STS1)   || \
                                         ((REGISTER) == I2C_Register_STS2)   || \
                                         ((REGISTER) == I2C_Register_CLKCTRL)|| \
                                         ((REGISTER) == I2C_Register_TMRISE))
/**
  * @}
  */

/** @defgroup I2C_SMBus_alert_pin_level
  * @{
  */

#define I2C_SMBusAlert_Low              ((uint16_t)0x2000)
#define I2C_SMBusAlert_High             ((uint16_t)0xDFFF)
#define IS_I2C_SMBUS_ALERT(ALERT)       (((ALERT) == I2C_SMBusAlert_Low) || \
                                         ((ALERT) == I2C_SMBusAlert_High))
/**
  * @}
  */

/** @defgroup I2C_PEC_position
  * @{
  */

#define I2C_PECPosition_Next            ((uint16_t)0x0800)
#define I2C_PECPosition_Current         ((uint16_t)0xF7FF)
#define IS_I2C_PEC_POSITION(POSITION)   (((POSITION) == I2C_PECPosition_Next) || \
                                         ((POSITION) == I2C_PECPosition_Current))
/**
  * @}
  */

/** @defgroup I2C_NCAK_position
  * @{
  */

