RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_i2c.h
#define I2C_NACKPosition_Next           ((uint16_t)0x0800)
#define I2C_NACKPosition_Current        ((uint16_t)0xF7FF)
#define IS_I2C_NACK_POSITION(POSITION)  (((POSITION) == I2C_NACKPosition_Next) || \
                                         ((POSITION) == I2C_NACKPosition_Current))
/**
  * @}
  */

/** @defgroup I2C_interrupts_definition
  * @{
  */

#define I2C_INT_BUF                     ((uint16_t)0x0400)
#define I2C_INT_EVT                     ((uint16_t)0x0200)
#define I2C_INT_ERR                     ((uint16_t)0x0100)
#define IS_I2C_CONFIG_INT(INT)          ((((INT) & (uint16_t)0xF8FF) == 0x00) && ((INT) != 0x00))
/**
  * @}
  */

/** @defgroup I2C_interrupts_definition
  * @{
  */

#define I2C_INT_SMBALERTF               ((uint32_t)0x01008000)
#define I2C_INT_TIMOUT                  ((uint32_t)0x01004000)
#define I2C_INT_PECERR                  ((uint32_t)0x01001000)
#define I2C_INT_OVRUN                   ((uint32_t)0x01000800)
#define I2C_INT_ACKFAIL                 ((uint32_t)0x01000400)
#define I2C_INT_ARLOST                  ((uint32_t)0x01000200)
#define I2C_INT_BUSERR                  ((uint32_t)0x01000100)
#define I2C_INT_TDE                     ((uint32_t)0x06000080)
#define I2C_INT_RDNE                    ((uint32_t)0x06000040)
#define I2C_INT_STOPF                   ((uint32_t)0x02000010)
#define I2C_INT_ADDR10F                 ((uint32_t)0x02000008)
#define I2C_INT_BTFF                    ((uint32_t)0x02000004)
#define I2C_INT_ADDRF                   ((uint32_t)0x02000002)
#define I2C_INT_STARTF                  ((uint32_t)0x02000001)

#define IS_I2C_CLEAR_INT(INT)           ((((INT) & (uint16_t)0x20FF) == 0x00) && ((INT) != (uint16_t)0x00))

#define IS_I2C_GET_INT(INT)             (((INT) == I2C_INT_SMBALERTF) || ((INT) == I2C_INT_TIMOUT) || \
                                         ((INT) == I2C_INT_PECERR)    || ((INT) == I2C_INT_OVRUN)  || \
                                         ((INT) == I2C_INT_ACKFAIL)   || ((INT) == I2C_INT_ARLOST) || \
                                         ((INT) == I2C_INT_BUSERR)    || ((INT) == I2C_INT_TDE)    || \
                                         ((INT) == I2C_INT_RDNE)      || ((INT) == I2C_INT_STOPF)  || \
                                         ((INT) == I2C_INT_ADDR10F)   || ((INT) == I2C_INT_BTFF)   || \
                                         ((INT) == I2C_INT_ADDRF)     || ((INT) == I2C_INT_STARTF))
/**
  * @}
  */

/** @defgroup I2C_flags_definition
  * @{
  */

/**
  * @brief  SR2 register flags
  */

#define I2C_FLAG_DUALF                  ((uint32_t)0x00800000)
#define I2C_FLAG_SMBHOSTADDRF           ((uint32_t)0x00400000)
#define I2C_FLAG_SMBDEFTADDRF           ((uint32_t)0x00200000)
#define I2C_FLAG_GCADDRF                ((uint32_t)0x00100000)
#define I2C_FLAG_TRF                    ((uint32_t)0x00040000)
#define I2C_FLAG_BUSYF                  ((uint32_t)0x00020000)
#define I2C_FLAG_MSF                    ((uint32_t)0x00010000)

/**
  * @brief  SR1 register flags
  */

#define I2C_FLAG_SMBALERTF              ((uint32_t)0x10008000)
#define I2C_FLAG_TIMOUT                 ((uint32_t)0x10004000)
#define I2C_FLAG_PECERR                 ((uint32_t)0x10001000)
#define I2C_FLAG_OVRUN                  ((uint32_t)0x10000800)
#define I2C_FLAG_ACKFAIL                ((uint32_t)0x10000400)
#define I2C_FLAG_ARLOST                 ((uint32_t)0x10000200)
#define I2C_FLAG_BUSERR                 ((uint32_t)0x10000100)
#define I2C_FLAG_TDE                    ((uint32_t)0x10000080)
#define I2C_FLAG_RDNE                   ((uint32_t)0x10000040)
#define I2C_FLAG_STOPF                  ((uint32_t)0x10000010)
#define I2C_FLAG_ADDR10F                ((uint32_t)0x10000008)
#define I2C_FLAG_BTFF                   ((uint32_t)0x10000004)
#define I2C_FLAG_ADDRF                  ((uint32_t)0x10000002)
#define I2C_FLAG_STARTF                 ((uint32_t)0x10000001)

#define IS_I2C_CLEAR_FLAG(FLAG)         ((((FLAG) & (uint16_t)0x20FF) == 0x00) && ((FLAG) != (uint16_t)0x00))

#define IS_I2C_GET_FLAG(FLAG)           (((FLAG) == I2C_FLAG_DUALF)        || ((FLAG) == I2C_FLAG_SMBHOSTADDRF) || \
                                         ((FLAG) == I2C_FLAG_SMBDEFTADDRF) || ((FLAG) == I2C_FLAG_GCADDRF)      || \
                                         ((FLAG) == I2C_FLAG_TRF)          || ((FLAG) == I2C_FLAG_BUSYF)        || \
                                         ((FLAG) == I2C_FLAG_MSF)          || ((FLAG) == I2C_FLAG_SMBALERTF)    || \
                                         ((FLAG) == I2C_FLAG_TIMOUT)       || ((FLAG) == I2C_FLAG_PECERR)       || \
                                         ((FLAG) == I2C_FLAG_OVRUN)        || ((FLAG) == I2C_FLAG_ACKFAIL)      || \
                                         ((FLAG) == I2C_FLAG_ARLOST)       || ((FLAG) == I2C_FLAG_BUSERR)       || \
                                         ((FLAG) == I2C_FLAG_TDE)          || ((FLAG) == I2C_FLAG_RDNE)         || \
                                         ((FLAG) == I2C_FLAG_STOPF)        || ((FLAG) == I2C_FLAG_ADDR10F)      || \
                                         ((FLAG) == I2C_FLAG_BTFF)         || ((FLAG) == I2C_FLAG_ADDRF)        || \
                                         ((FLAG) == I2C_FLAG_STARTF))
/**
  * @}
  */

/** @defgroup I2C_Events
  * @{
  */

/*========================================

                     I2C Master Events (Events grouped in order of communication)
                                                        ==========================================*/
/**
  * @brief  Communication start
  *
  * After sending the START condition (I2C_GenerateSTART() function) the master
  * has to wait for this event. It means that the Start condition has been correctly
  * released on the I2C bus (the bus is free, no other devices is communicating).
  *
  */
/* --EV5 */
#define  I2C_EVENT_MASTER_START_GENERATED               ((uint32_t)0x00030001)  /* BUSY, MSL and SB flag */

/**
  * @brief  Address Acknowledge
  *
  * After checking on EV5 (start condition correctly released on the bus), the
  * master sends the address of the slave(s) with which it will communicate
  * (I2C_Send7bitAddress() function, it also determines the direction of the communication:
  * Master transmitter or Receiver). Then the master has to wait that a slave acknowledges
  * his address. If an acknowledge is sent on the bus, one of the following events will
  * be set:
  *
  *  1) In case of Master Receiver (7-bit addressing): the I2C_EVENT_MASTER_ADDRESS_WITH_RECEIVER
  *     event is set.
  *
  *  2) In case of Master Transmitter (7-bit addressing): the I2C_EVENT_MASTER_ADDRESS | I2C_EVENT_MASTER_TRANSMITTER
  *     is set
  *
  *  3) In case of 10-Bit addressing mode, the master (just after generating the START
  *  and checking on EV5) has to send the header of 10-bit addressing mode (I2C_SendData()
  *  function). Then master should wait on EV9. It means that the 10-bit addressing
  *  header has been correctly sent on the bus. Then master should send the second part of
  *  the 10-bit address (LSB) using the function I2C_Send7bitAddress(). Then master
  *  should wait for event EV6.
  *
  */

